# Ensemble exercise

### 1. Import Library pandas, numpy and model train_test_split, RandomForestClassifier, adabost

In [1]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn import ensemble
from sklearn.ensemble import RandomForestClassifier
from sklearn.ensemble import AdaBoostClassifier

### 2. Read Data ,Check data describe and info

In [2]:
df = pd.read_csv('train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### 3. drop Name, passengerId and Ticket columns

In [6]:
df_clean = df.drop(['Name','Ticket','PassengerId'], axis = 1)
df_clean.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0         0       3    male  22.0      1      0   7.2500   NaN        S
1         1       1  female  38.0      1      0  71.2833   C85        C
2         1       3  female  26.0      0      0   7.9250   NaN        S
3         1       1  female  35.0      1      0  53.1000  C123        S
4         0       3    male  35.0      0      0   8.0500   NaN        S

### 4. Check null and drop one Coulm has more null Value

In [7]:
df_clean.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [8]:
df_cleaned = df_clean.drop(['Cabin'], axis = 1)
df_cleaned.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

### 5. fillnull Age with mean and fillnull Embarked With mode

In [9]:
age_mean = df_cleaned['Age'].mean()
embarked_mode = df_cleaned['Embarked'].mode()
nan_replacements = {'Age': age_mean,'Embarked': embarked_mode[0]}
new_df = df_cleaned.fillna(nan_replacements)
new_df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

### 6. GetDummies for Sex and EmbarKed

In [10]:
dum_df = pd.get_dummies(data = new_df, columns=['Sex', 'Embarked'])
dum_df.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,0,3,22.0,1,0,7.2500,0,1,0,0,1
1,1,1,38.0,1,0,71.2833,1,0,1,0,0
2,1,3,26.0,0,0,7.9250,1,0,0,0,1
3,1,1,35.0,1,0,53.1000,1,0,0,0,1
4,0,3,35.0,0,0,8.0500,0,1,0,0,1

### 7. put indpendent Coulm in X and dependent Coulm in y

In [11]:
X = dum_df.iloc[:, 1:] 
y = dum_df.iloc[:, :1]

In [12]:
print(dum_df["Survived"].value_counts())

0    549
1    342
Name: Survived, dtype: int64

In [13]:
from sklearn.utils import resample

df_majority = dum_df[dum_df.Survived==0]
df_minority = dum_df[dum_df.Survived==1]
 
# Upsample minority class
df_minority_upsampled = resample(df_minority, 
                                 replace=True,     # sample with replacement
                                 n_samples=549,  # to match majority class
                                 random_state=1)   # reproducible results
 
# Combine majority class with upsampled minority class
df_upsampled = pd.concat([df_majority, df_minority_upsampled])

# Display new class counts
df_upsampled.Survived.value_counts(normalize=True)

1    0.5
0    0.5
Name: Survived, dtype: float64

In [14]:
df_upsampled.duplicated().sum()

373

# Split data With test Size .2 and random state 0

In [15]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 0)

In [16]:
from sklearn import preprocessing
from sklearn.preprocessing import StandardScaler
sc = preprocessing.StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(X_test)

# Training Model With RandomForestClassifier andAdaBoostClassifier, make n_estimator=100 ,and random_state =1,other prameter with default value

In [17]:
rf_model = RandomForestClassifier(n_estimators= 100, random_state=1)
y_train = y_train.values.ravel()
rf_model.fit(X_train, y_train)
print(f'Model Accuracy for train data: {rf_model.score(X_train, y_train)}')
print(f'Model Accuracy for test data: {rf_model.score(X_test, y_test)}')

Model Accuracy for train data: 0.9817415730337079
Model Accuracy for test data: 0.8212290502793296

In [18]:
bag_clf =ensemble.BaggingClassifier(n_estimators = 100, random_state=1)
bag_clf.fit(X_train, y_train)
print(f'Model Accuracy for train data: {bag_clf.score(X_train, y_train)}')
print(f'Model Accuracy for test data: {bag_clf.score(X_test, y_test)}')

Model Accuracy for train data: 0.9817415730337079
Model Accuracy for test data: 0.8156424581005587

In [19]:
ada_clf = ensemble.AdaBoostClassifier(n_estimators = 100,random_state=1 )

ada_clf.fit(X_train,y_train)
print(f'Model Accuracy for train data: {ada_clf.score(X_train, y_train)}')
print(f'Model Accuracy for test data: {ada_clf.score(X_test, y_test)}')

Model Accuracy for train data: 0.8525280898876404
Model Accuracy for test data: 0.8156424581005587